; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob63) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 crate14 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 hoist13 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate2)
	(at pallet1 depot1)
	(clear crate3)
	(at pallet2 depot2)
	(clear crate12)
	(at pallet3 distributor0)
	(clear crate9)
	(at pallet4 distributor1)
	(clear crate11)
	(at pallet5 distributor2)
	(clear crate10)
	(at pallet6 depot1)
	(clear crate14)
	(at pallet7 depot0)
	(clear pallet7)
	(at truck0 distributor0)
	(at truck1 distributor2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot2)
	(available hoist6)
	(at hoist7 distributor1)
	(available hoist7)
	(at hoist8 distributor2)
	(available hoist8)
	(at hoist9 distributor0)
	(available hoist9)
	(at hoist10 distributor1)
	(available hoist10)
	(at hoist11 distributor2)
	(available hoist11)
	(at hoist12 depot1)
	(available hoist12)
	(at hoist13 depot1)
	(available hoist13)
	(at crate0 depot2)
	(on crate0 pallet2)
	(at crate1 depot1)
	(on crate1 pallet6)
	(at crate2 depot0)
	(on crate2 pallet0)
	(at crate3 depot1)
	(on crate3 pallet1)
	(at crate4 distributor1)
	(on crate4 pallet4)
	(at crate5 distributor2)
	(on crate5 pallet5)
	(at crate6 depot1)
	(on crate6 crate1)
	(at crate7 distributor2)
	(on crate7 crate5)
	(at crate8 distributor2)
	(on crate8 crate7)
	(at crate9 distributor0)
	(on crate9 pallet3)
	(at crate10 distributor2)
	(on crate10 crate8)
	(at crate11 distributor1)
	(on crate11 crate4)
	(at crate12 depot2)
	(on crate12 crate0)
	(at crate13 depot1)
	(on crate13 crate6)
	(at crate14 depot1)
	(on crate14 crate13)
)

(:goal (and
		(on crate0 crate6)
		(on crate2 pallet3)
		(on crate3 crate9)
		(on crate4 crate7)
		(on crate5 pallet5)
		(on crate6 pallet0)
		(on crate7 pallet2)
		(on crate8 crate10)
		(on crate9 pallet6)
		(on crate10 crate14)
		(on crate11 pallet4)
		(on crate12 crate8)
		(on crate13 pallet7)
		(on crate14 crate11)
	)
))

; plan
1. (lift hoist8 crate10 crate8 distributor2)
   deleted: (at crate10 distributor2) (clear crate10) (available hoist8) (on crate10 crate8)
   added: (lifting hoist8 crate10) (clear crate8)
   goals met: 1 of 14
2. (lift hoist7 crate11 crate4 distributor1)
   deleted: (at crate11 distributor1) (clear crate11) (available hoist7) (on crate11 crate4)
   added: (lifting hoist7 crate11) (clear crate4)
   goals met: 1 of 14
3. (lift hoist6 crate12 crate0 depot2)
   deleted: (at crate12 depot2) (clear crate12) (available hoist6) (on crate12 crate0)
   added: (lifting hoist6 crate12) (clear crate0)
   goals met: 1 of 14
4. (lift hoist2 crate0 pallet2 depot2)
   deleted: (at crate0 depot2) (clear crate0) (available hoist2) (on crate0 pallet2)
   added: (lifting hoist2 crate0) (clear pallet2)
   goals met: 1 of 14
5. (lift hoist13 crate14 crate13 depot1)
   deleted: (at crate14 depot1) (clear crate14) (available hoist13) (on crate14 crate13)
   added: (lifting hoist13 crate14) (clear crate13)
   goals met: 1 of 14
6. (drive truck1 distributor2 depot1)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot1)
   goals met: 1 of 14
7. (load hoist13 crate14 truck1 depot1)
   deleted: (lifting hoist13 crate14)
   added: (in crate14 truck1) (available hoist13)
   goals met: 1 of 14
8. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 1 of 14
9. (load hoist2 crate0 truck0 depot2)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck0) (available hoist2)
   goals met: 1 of 14
10. (load hoist6 crate12 truck0 depot2)
   deleted: (lifting hoist6 crate12)
   added: (in crate12 truck0) (available hoist6)
   goals met: 1 of 14
11. (drive truck0 depot2 depot1)
   deleted: (at truck0 depot2)
   added: (at truck0 depot1)
   goals met: 1 of 14
12. (drive truck1 depot1 distributor1)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor1)
   goals met: 1 of 14
13. (unload hoist4 crate14 truck1 distributor1)
   deleted: (in crate14 truck1) (available hoist4)
   added: (lifting hoist4 crate14)
   goals met: 1 of 14
14. (unload hoist13 crate0 truck0 depot1)
   deleted: (in crate0 truck0) (available hoist13)
   added: (lifting hoist13 crate0)
   goals met: 1 of 14
15. (lift hoist12 crate13 crate6 depot1)
   deleted: (at crate13 depot1) (clear crate13) (available hoist12) (on crate13 crate6)
   added: (lifting hoist12 crate13) (clear crate6)
   goals met: 1 of 14
16. (load hoist12 crate13 truck0 depot1)
   deleted: (lifting hoist12 crate13)
   added: (in crate13 truck0) (available hoist12)
   goals met: 1 of 14
17. (lift hoist10 crate4 pallet4 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist10) (on crate4 pallet4)
   added: (lifting hoist10 crate4) (clear pallet4)
   goals met: 1 of 14
18. (load hoist10 crate4 truck1 distributor1)
   deleted: (lifting hoist10 crate4)
   added: (in crate4 truck1) (available hoist10)
   goals met: 1 of 14
19. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   goals met: 1 of 14
20. (unload hoist5 crate4 truck1 distributor2)
   deleted: (in crate4 truck1) (available hoist5)
   added: (lifting hoist5 crate4)
   goals met: 1 of 14
21. (drop hoist7 crate11 pallet4 distributor1)
   deleted: (lifting hoist7 crate11) (clear pallet4)
   added: (available hoist7) (at crate11 distributor1) (clear crate11) (on crate11 pallet4)
   goals met: 2 of 14
22. (drop hoist4 crate14 crate11 distributor1)
   deleted: (lifting hoist4 crate14) (clear crate11)
   added: (available hoist4) (at crate14 distributor1) (clear crate14) (on crate14 crate11)
   goals met: 3 of 14
23. (lift hoist12 crate3 pallet1 depot1)
   deleted: (at crate3 depot1) (clear crate3) (available hoist12) (on crate3 pallet1)
   added: (lifting hoist12 crate3) (clear pallet1)
   goals met: 3 of 14
24. (load hoist12 crate3 truck0 depot1)
   deleted: (lifting hoist12 crate3)
   added: (in crate3 truck0) (available hoist12)
   goals met: 3 of 14
25. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 3 of 14
26. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 3 of 14
27. (unload hoist9 crate3 truck0 distributor0)
   deleted: (in crate3 truck0) (available hoist9)
   added: (lifting hoist9 crate3)
   goals met: 3 of 14
28. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 3 of 14
29. (lift hoist0 crate2 pallet0 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 pallet0)
   added: (lifting hoist0 crate2) (clear pallet0)
   goals met: 3 of 14
30. (load hoist0 crate2 truck0 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck0) (available hoist0)
   goals met: 3 of 14
31. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 3 of 14
32. (lift hoist12 crate6 crate1 depot1)
   deleted: (at crate6 depot1) (clear crate6) (available hoist12) (on crate6 crate1)
   added: (lifting hoist12 crate6) (clear crate1)
   goals met: 3 of 14
33. (drop hoist12 crate6 pallet1 depot1)
   deleted: (lifting hoist12 crate6) (clear pallet1)
   added: (available hoist12) (at crate6 depot1) (clear crate6) (on crate6 pallet1)
   goals met: 3 of 14
34. (load hoist8 crate10 truck1 distributor2)
   deleted: (lifting hoist8 crate10)
   added: (in crate10 truck1) (available hoist8)
   goals met: 3 of 14
35. (lift hoist11 crate8 crate7 distributor2)
   deleted: (at crate8 distributor2) (clear crate8) (available hoist11) (on crate8 crate7)
   added: (lifting hoist11 crate8) (clear crate7)
   goals met: 3 of 14
36. (drop hoist5 crate4 crate7 distributor2)
   deleted: (lifting hoist5 crate4) (clear crate7)
   added: (available hoist5) (at crate4 distributor2) (clear crate4) (on crate4 crate7)
   goals met: 4 of 14
37. (unload hoist8 crate10 truck1 distributor2)
   deleted: (in crate10 truck1) (available hoist8)
   added: (lifting hoist8 crate10)
   goals met: 4 of 14
38. (drop hoist8 crate10 crate4 distributor2)
   deleted: (lifting hoist8 crate10) (clear crate4)
   added: (available hoist8) (at crate10 distributor2) (clear crate10) (on crate10 crate4)
   goals met: 4 of 14
39. (drop hoist11 crate8 crate10 distributor2)
   deleted: (lifting hoist11 crate8) (clear crate10)
   added: (available hoist11) (at crate8 distributor2) (clear crate8) (on crate8 crate10)
   goals met: 5 of 14
40. (drive truck0 distributor0 distributor2)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor2)
   goals met: 5 of 14
41. (unload hoist8 crate12 truck0 distributor2)
   deleted: (in crate12 truck0) (available hoist8)
   added: (lifting hoist8 crate12)
   goals met: 5 of 14
42. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 5 of 14
43. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 5 of 14
44. (unload hoist3 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist3)
   added: (lifting hoist3 crate2)
   goals met: 5 of 14
45. (drop hoist9 crate3 crate9 distributor0)
   deleted: (lifting hoist9 crate3) (clear crate9)
   added: (available hoist9) (at crate3 distributor0) (clear crate3) (on crate3 crate9)
   goals met: 6 of 14
46. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 6 of 14
47. (unload hoist0 crate13 truck0 depot0)
   deleted: (in crate13 truck0) (available hoist0)
   added: (lifting hoist0 crate13)
   goals met: 6 of 14
48. (drop hoist0 crate13 pallet7 depot0)
   deleted: (lifting hoist0 crate13) (clear pallet7)
   added: (available hoist0) (at crate13 depot0) (clear crate13) (on crate13 pallet7)
   goals met: 7 of 14
49. (lift hoist12 crate6 pallet1 depot1)
   deleted: (at crate6 depot1) (clear crate6) (available hoist12) (on crate6 pallet1)
   added: (lifting hoist12 crate6) (clear pallet1)
   goals met: 7 of 14
50. (drop hoist8 crate12 crate8 distributor2)
   deleted: (lifting hoist8 crate12) (clear crate8)
   added: (available hoist8) (at crate12 distributor2) (clear crate12) (on crate12 crate8)
   goals met: 8 of 14
51. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   goals met: 8 of 14
52. (drop hoist12 crate6 pallet1 depot1)
   deleted: (lifting hoist12 crate6) (clear pallet1)
   added: (available hoist12) (at crate6 depot1) (clear crate6) (on crate6 pallet1)
   goals met: 8 of 14
53. (lift hoist8 crate12 crate8 distributor2)
   deleted: (at crate12 distributor2) (clear crate12) (available hoist8) (on crate12 crate8)
   added: (lifting hoist8 crate12) (clear crate8)
   goals met: 7 of 14
54. (lift hoist12 crate6 pallet1 depot1)
   deleted: (at crate6 depot1) (clear crate6) (available hoist12) (on crate6 pallet1)
   added: (lifting hoist12 crate6) (clear pallet1)
   goals met: 7 of 14
55. (load hoist12 crate6 truck0 depot1)
   deleted: (lifting hoist12 crate6)
   added: (in crate6 truck0) (available hoist12)
   goals met: 7 of 14
56. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 7 of 14
57. (unload hoist0 crate6 truck0 depot0)
   deleted: (in crate6 truck0) (available hoist0)
   added: (lifting hoist0 crate6)
   goals met: 7 of 14
58. (drop hoist0 crate6 pallet0 depot0)
   deleted: (lifting hoist0 crate6) (clear pallet0)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 pallet0)
   goals met: 8 of 14
59. (drive truck1 distributor2 depot1)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot1)
   goals met: 8 of 14
60. (load hoist13 crate0 truck1 depot1)
   deleted: (lifting hoist13 crate0)
   added: (in crate0 truck1) (available hoist13)
   goals met: 8 of 14
61. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 8 of 14
62. (unload hoist0 crate0 truck1 depot0)
   deleted: (in crate0 truck1) (available hoist0)
   added: (lifting hoist0 crate0)
   goals met: 8 of 14
63. (drop hoist0 crate0 crate6 depot0)
   deleted: (lifting hoist0 crate0) (clear crate6)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 crate6)
   goals met: 9 of 14
64. (lift hoist5 crate8 crate10 distributor2)
   deleted: (at crate8 distributor2) (clear crate8) (available hoist5) (on crate8 crate10)
   added: (lifting hoist5 crate8) (clear crate10)
   goals met: 8 of 14
65. (lift hoist11 crate10 crate4 distributor2)
   deleted: (at crate10 distributor2) (clear crate10) (available hoist11) (on crate10 crate4)
   added: (lifting hoist11 crate10) (clear crate4)
   goals met: 8 of 14
66. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   goals met: 8 of 14
67. (load hoist11 crate10 truck0 distributor2)
   deleted: (lifting hoist11 crate10)
   added: (in crate10 truck0) (available hoist11)
   goals met: 8 of 14
68. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   goals met: 8 of 14
69. (unload hoist7 crate10 truck0 distributor1)
   deleted: (in crate10 truck0) (available hoist7)
   added: (lifting hoist7 crate10)
   goals met: 8 of 14
70. (drop hoist7 crate10 crate14 distributor1)
   deleted: (lifting hoist7 crate10) (clear crate14)
   added: (available hoist7) (at crate10 distributor1) (clear crate10) (on crate10 crate14)
   goals met: 9 of 14
71. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   goals met: 9 of 14
72. (load hoist5 crate8 truck0 distributor2)
   deleted: (lifting hoist5 crate8)
   added: (in crate8 truck0) (available hoist5)
   goals met: 9 of 14
73. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   goals met: 9 of 14
74. (unload hoist7 crate8 truck0 distributor1)
   deleted: (in crate8 truck0) (available hoist7)
   added: (lifting hoist7 crate8)
   goals met: 9 of 14
75. (drop hoist7 crate8 crate10 distributor1)
   deleted: (lifting hoist7 crate8) (clear crate10)
   added: (available hoist7) (at crate8 distributor1) (clear crate8) (on crate8 crate10)
   goals met: 10 of 14
76. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   goals met: 10 of 14
77. (load hoist8 crate12 truck0 distributor2)
   deleted: (lifting hoist8 crate12)
   added: (in crate12 truck0) (available hoist8)
   goals met: 10 of 14
78. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   goals met: 10 of 14
79. (unload hoist7 crate12 truck0 distributor1)
   deleted: (in crate12 truck0) (available hoist7)
   added: (lifting hoist7 crate12)
   goals met: 10 of 14
80. (drop hoist7 crate12 crate8 distributor1)
   deleted: (lifting hoist7 crate12) (clear crate8)
   added: (available hoist7) (at crate12 distributor1) (clear crate12) (on crate12 crate8)
   goals met: 11 of 14
81. (lift hoist8 crate4 crate7 distributor2)
   deleted: (at crate4 distributor2) (clear crate4) (available hoist8) (on crate4 crate7)
   added: (lifting hoist8 crate4) (clear crate7)
   goals met: 10 of 14
82. (lift hoist5 crate7 crate5 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist5) (on crate7 crate5)
   added: (lifting hoist5 crate7) (clear crate5)
   goals met: 10 of 14
83. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   goals met: 10 of 14
84. (load hoist5 crate7 truck0 distributor2)
   deleted: (lifting hoist5 crate7)
   added: (in crate7 truck0) (available hoist5)
   goals met: 10 of 14
85. (drive truck0 distributor2 depot2)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot2)
   goals met: 10 of 14
86. (unload hoist6 crate7 truck0 depot2)
   deleted: (in crate7 truck0) (available hoist6)
   added: (lifting hoist6 crate7)
   goals met: 10 of 14
87. (drop hoist6 crate7 pallet2 depot2)
   deleted: (lifting hoist6 crate7) (clear pallet2)
   added: (available hoist6) (at crate7 depot2) (clear crate7) (on crate7 pallet2)
   goals met: 11 of 14
88. (drive truck0 depot2 distributor2)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor2)
   goals met: 11 of 14
89. (load hoist8 crate4 truck0 distributor2)
   deleted: (lifting hoist8 crate4)
   added: (in crate4 truck0) (available hoist8)
   goals met: 11 of 14
90. (drive truck0 distributor2 depot2)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot2)
   goals met: 11 of 14
91. (unload hoist6 crate4 truck0 depot2)
   deleted: (in crate4 truck0) (available hoist6)
   added: (lifting hoist6 crate4)
   goals met: 11 of 14
92. (drop hoist6 crate4 crate7 depot2)
   deleted: (lifting hoist6 crate4) (clear crate7)
   added: (available hoist6) (at crate4 depot2) (clear crate4) (on crate4 crate7)
   goals met: 12 of 14
93. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 12 of 14
94. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 12 of 14
95. (lift hoist9 crate3 crate9 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist9) (on crate3 crate9)
   added: (lifting hoist9 crate3) (clear crate9)
   goals met: 11 of 14
96. (load hoist9 crate3 truck0 distributor0)
   deleted: (lifting hoist9 crate3)
   added: (in crate3 truck0) (available hoist9)
   goals met: 11 of 14
97. (lift hoist9 crate9 pallet3 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist9) (on crate9 pallet3)
   added: (lifting hoist9 crate9) (clear pallet3)
   goals met: 11 of 14
98. (drop hoist3 crate2 pallet3 distributor0)
   deleted: (lifting hoist3 crate2) (clear pallet3)
   added: (available hoist3) (at crate2 distributor0) (clear crate2) (on crate2 pallet3)
   goals met: 12 of 14
99. (unload hoist3 crate3 truck0 distributor0)
   deleted: (in crate3 truck0) (available hoist3)
   added: (lifting hoist3 crate3)
   goals met: 12 of 14
100. (load hoist9 crate9 truck0 distributor0)
   deleted: (lifting hoist9 crate9)
   added: (in crate9 truck0) (available hoist9)
   goals met: 12 of 14
101. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 12 of 14
102. (unload hoist13 crate9 truck0 depot1)
   deleted: (in crate9 truck0) (available hoist13)
   added: (lifting hoist13 crate9)
   goals met: 12 of 14
103. (load hoist3 crate3 truck1 distributor0)
   deleted: (lifting hoist3 crate3)
   added: (in crate3 truck1) (available hoist3)
   goals met: 12 of 14
104. (drive truck1 distributor0 depot1)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot1)
   goals met: 12 of 14
105. (unload hoist12 crate3 truck1 depot1)
   deleted: (in crate3 truck1) (available hoist12)
   added: (lifting hoist12 crate3)
   goals met: 12 of 14
106. (lift hoist1 crate1 pallet6 depot1)
   deleted: (at crate1 depot1) (clear crate1) (available hoist1) (on crate1 pallet6)
   added: (lifting hoist1 crate1) (clear pallet6)
   goals met: 12 of 14
107. (drop hoist13 crate9 pallet6 depot1)
   deleted: (lifting hoist13 crate9) (clear pallet6)
   added: (available hoist13) (at crate9 depot1) (clear crate9) (on crate9 pallet6)
   goals met: 13 of 14
108. (drop hoist12 crate3 crate9 depot1)
   deleted: (lifting hoist12 crate3) (clear crate9)
   added: (available hoist12) (at crate3 depot1) (clear crate3) (on crate3 crate9)
   goals met: 14 of 14
